# Pivot Table

A pivot table is a similar operation that is commonly seen in spreadsheets and other programs that operate on tabular data. The pivot table takes simple column-wise data as input, and groups the entries into a two-dimensional table that provides a multidimensional summarization of the data.

Create a dataframe:

In [2]:
import pandas as pd
import numpy as np

d = {
    'Name':['Aman','Bobby','Kanak','Aman','Bobby','Kanak',
            'Aman','Bobby','Kanak','Aman','Bobby','Kanak'],
    'Exam':['Semester 1','Semester 1','Semester 1','Semester 1','Semester 1','Semester 1',
            'Semester 2','Semester 2','Semester 2','Semester 2','Semester 2','Semester 2'],
     
    'Subject':['Mathematics','Mathematics','Mathematics','Science','Science','Science',
               'Mathematics','Mathematics','Mathematics','Science','Science','Science'],
   'Score':[62,47,55,74,31,77,85,63,42,67,89,81]}
 
df = pd.DataFrame(d,columns=['Name','Exam','Subject','Score'])
df

     Name        Exam      Subject  Score
0    Aman  Semester 1  Mathematics     62
1   Bobby  Semester 1  Mathematics     47
2   Kanak  Semester 1  Mathematics     55
3    Aman  Semester 1      Science     74
4   Bobby  Semester 1      Science     31
5   Kanak  Semester 1      Science     77
6    Aman  Semester 2  Mathematics     85
7   Bobby  Semester 2  Mathematics     63
8   Kanak  Semester 2  Mathematics     42
9    Aman  Semester 2      Science     67
10  Bobby  Semester 2      Science     89
11  Kanak  Semester 2      Science     81

Create pivot table in pandas with aggregate function mean:

In [3]:
pd.pivot_table(df, index=['Exam','Subject'], aggfunc='mean')

                            Score
Exam       Subject
Semester 1 Mathematics  54.666667
           Science      60.666667
Semester 2 Mathematics  63.333333
           Science      79.000000

Create pivot table in Pandas python with aggregate function sum:

In [4]:
# get the sum of scores of students across subjects

pd.pivot_table(df, index=['Name','Subject'], aggfunc='sum')

                   Score
Name  Subject
Aman  Mathematics    147
      Science        141
Bobby Mathematics    110
      Science        120
Kanak Mathematics     97
      Science        158

Create pivot table in Pandas python with aggregate function count:

In [5]:
# shows the count of student who appeared for the exam of different subject

pd.pivot_table(df, index=['Exam','Subject'], aggfunc='count')

                        Name  Score
Exam       Subject
Semester 1 Mathematics     3      3
           Science         3      3
Semester 2 Mathematics     3      3
           Science         3      3